InformationRegisters/ТелеграмТаймеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмТаймеры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСрабатывания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяАктуальности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТелеграмУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеУсловия</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТелеграмУсловия</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмБоты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмОбработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВходящееОбновлениеXML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерПП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграмТаймеры/Ext/ManagerModule.bsl
Процедура УстановитьВыполнениеПоТаймеру(Бот, Обработка, ВходящееОбновление, ДатаСрабатывания, ВремяАктуальности = Неопределено, Условие = Неопределено, ЗначениеУсловия = Неопределено, Пояснение = "") Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ВходящееОбновление);
	ВходящееОбновлениеXML = ЗаписьXML.Закрыть();
	
	НачатьТранзакцию();
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ТелеграмТаймеры");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	БлокировкаДанных.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ТелеграмТаймеры.НомерПП) КАК НомерПП
	|ИЗ
	|	РегистрСведений.ТелеграмТаймеры КАК ТелеграмТаймеры";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	НомерПП = ?(Выборка.НомерПП = NULL, 0, Выборка.НомерПП) + 1;
	
	МЗ = РегистрыСведений.ТелеграмТаймеры.СоздатьМенеджерЗаписи();
	МЗ.НомерПП = НомерПП;
	МЗ.ДатаСрабатывания = ДатаСрабатывания;
	МЗ.ВремяАктуальности = ВремяАктуальности;
	МЗ.Условие = Условие;
	МЗ.ЗначениеУсловия = ЗначениеУсловия;
	МЗ.Бот = Бот;
	МЗ.Обработка = Обработка;
	МЗ.ВходящееОбновлениеXML = ВходящееОбновлениеXML;
	МЗ.Пояснение = Пояснение;
	МЗ.Выполнено = Ложь;
	МЗ.Записать();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура ВыполнитьЗапланированныеОбработки() Экспорт
	
	ДатаВремяТаймера = ТекущаяДата();
	
	МассивУдалить = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаВремяТаймера", ДатаВремяТаймера);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТелеграмТаймеры.НомерПП,
	|	ТелеграмТаймеры.ДатаСрабатывания,
	|	ТелеграмТаймеры.ВремяАктуальности,
	|	ТелеграмТаймеры.Обработка,
	|	ТелеграмТаймеры.Бот,
	|	ТелеграмТаймеры.ВходящееОбновлениеXML,
	|	ТелеграмТаймеры.Условие,
	|	ТелеграмТаймеры.ЗначениеУсловия,
	|	ТелеграмТаймеры.Пояснение
	|ИЗ
	|	РегистрСведений.ТелеграмТаймеры КАК ТелеграмТаймеры
	|ГДЕ
	|	ТелеграмТаймеры.ДатаСрабатывания <= &ДатаВремяТаймера
	|	И НЕ ТелеграмТаймеры.Выполнено";
	
	Результат = Запрос.Выполнить();
	
	ТаблицаЗначений = Результат.Выгрузить();
	ТаблицаЗначений.Колонки.Добавить("ВходящееОбновление", Новый ОписаниеТипов("Структура"));
	
	Для Каждого ТекущаяСтрока Из ТаблицаЗначений Цикл
		МЗ = РегистрыСведений.ТелеграмТаймеры.СоздатьМенеджерЗаписи();
		МЗ.НомерПП = ТекущаяСтрока.НомерПП;
		МЗ.Прочитать();
		МЗ.Выполнено = Истина;
		МЗ.ДатаВыполнения = ДатаВремяТаймера;
		МЗ.Записать();
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из ТаблицаЗначений Цикл
		
		Если ТекущаяСтрока.ВремяАктуальности > 0 Тогда
			ГраницаВыполнения = ТекущаяСтрока.ДатаСрабатывания + ТекущаяСтрока.ВремяАктуальности;
			Если ГраницаВыполнения < ДатаВремяТаймера Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ВходящееОбновление = Неопределено;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.Условие) Тогда
			ВходящееОбновление = ВосстановитьВходящееОбновление(ТекущаяСтрока.ВходящееОбновлениеXML);
			ЛевоеЗначение = ПланыВидовХарактеристик.ТелеграмУсловия.ЗначениеУсловия(ТекущаяСтрока.Условие, ВходящееОбновление);
			Если ЛевоеЗначение <> ТекущаяСтрока.ЗначениеУсловия Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ВходящееОбновление = Неопределено Тогда
			ВходящееОбновление = ВосстановитьВходящееОбновление(ТекущаяСтрока.ВходящееОбновлениеXML);
		КонецЕсли;
		
		Пояснение = СтрШаблон("Таймер %1, %2", Формат(ТекущаяСтрока.НомерПП, "ЧГ="), ТекущаяСтрока.Пояснение);	
			
		Справочники.ТелеграмОбработки.ВыполнитьОбработку(
			ТекущаяСтрока.Обработка,
			ТекущаяСтрока.Бот,
			ВходящееОбновление,,,
			Пояснение);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВосстановитьВходящееОбновление(СтрокаXML)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	ВходящееОбновление = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	Возврат ВходящееОбновление;
	
КонецФункции

Процедура Очистить() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТелеграмТаймеры.Бот,
	|	ЕСТЬNULL(ТелеграмБоты.ХранитьЖурналДней, 0) КАК ХранитьЖурналДней
	|ИЗ
	|	РегистрСведений.ТелеграмТаймеры КАК ТелеграмТаймеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТелеграмБоты КАК ТелеграмБоты
	|		ПО ТелеграмТаймеры.Бот = ТелеграмБоты.Ссылка";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТелеграмТаймеры.НомерПП
	|ИЗ
	|	РегистрСведений.ТелеграмТаймеры КАК ТелеграмТаймеры
	|ГДЕ
	|	ТелеграмТаймеры.Выполнено
	|	И ТелеграмТаймеры.Бот = &Бот
	|	И ТелеграмТаймеры.ДатаВыполнения < &ДатаВыполнения";
	
	МенеджерЗаписи = РегистрыСведений.ТелеграмТаймеры.СоздатьМенеджерЗаписи();
	
	Пока Выборка.Следующий() Цикл
		ДатаВыполнения = ТекущаяДата() - Выборка.ХранитьЖурналДней * 24 * 60 * 60;
		Запрос.УстановитьПараметр("Бот", Выборка.Бот);
		Запрос.УстановитьПараметр("ДатаВыполнения", ДатаВыполнения);
		ВыборкаЗаписей = Запрос.Выполнить().Выбрать();
		Пока ВыборкаЗаписей.Следующий() Цикл
			МенеджерЗаписи.НомерПП = ВыборкаЗаписей.НомерПП;
			МенеджерЗаписи.Удалить();
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
